Config/Catalogs/Договоры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Договоры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АналитическийКодРазделаСчетаКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаНоминала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиГрафикПлатежей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиПланГрафикИсполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбязательства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбязательстваЭБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбязательствЭБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОснованияЕБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовОснованийЕБП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосударственныйКонтрактПоГОЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГосударственныеОборонныеЗаказы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговора</Name>
					<Comment>Дата заключения договора (контракта), возникновения иных обязательств</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПомещенияВАрхив</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгосрочный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаключаетсяПоРезультатамКонкурсныхПроцедур</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРаздел7ДекларацииНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КодыОперацийРаздела7ДекларацииПоНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЦелиПродавца</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрактСУчастникомГОЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольЗаполненияРабочегоНаименования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПСМатериаловВПоступлениеМЗ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНастройкиКПСВПоступленияхМЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПСПродавца</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеСодержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЦеннойБумаги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПрименятьККТКромеРасчетовНаличнымиИЭСП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураПлатежаДляЧекаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Comment>Номер договора (контракта)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЦеннойБумаги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоминальнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормативноПравовойАкт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаВстречнымПредоставлением</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтдельныйСчетДляРасчетовПоГОЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокРегистрацииСчетаФактурыНаАванс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокРегистрацииСчетовФактурНаАванс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакЗавершенияКонкурсныхПроцедур</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакСпособаРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакиСпособаРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентКомиссионногоВознаграждения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПубличноеНормативноеОбязательство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомерЦеннойБумаги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатЗавершенияКонкурсныхПроцедур</Name>
					<Comment>1 - заключение договора, 2 - отказ от заключения договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияЦеннойБумаги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаполненияСтавкиНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗаполненияСтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаКомиссионногоВознаграждения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаКомиссионногоВознаграждения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплатыВРабочихДнях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеИКазначейскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНазначенияПлатежа</Name>
					<Comment>Текст назначения платежа для автоподстановки в платежных документах</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоговораНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДоговоровДляНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПредметаДоговора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЭлектронныйДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗакупкиЕБП</Name>
					<Comment>purchaseType</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипЗакупкиЕБП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеИКазначейскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>254</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>254</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыЕИС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаДляСкачивания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/Договоры/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Анализирует пары ссылок справочника на возможность замены одной на другую 
// во всех местах использования с прикладной точки зрения.
// Проверки на запрет замены групп и ссылок разных типов производятся автоматически при начале замены.
//
// Параметры:
//     ПарыЗамен - Соответствие - Ключ - что будет заменено, значение - на что будет заменено.
//     Параметры - Структура    - Набор флагов, описывающих действие с заменяемыми элементами.
//                                Содержит необязательные реквизиты:
//                     * СпособУдаления - Строка, может принимать значения:
//                         "Непосредственно" - Если после замены ссылка нигде не используется,
//                                             то она будет удалена непосредственно
//                         "Пометка"         - Если после замены ссылка не используется, то
//                                             она будет помечена на удаление.
//                         Любые другие значения говорят о том, что заменяемая ссылка не будет изменена.
//
// Возвращаемое значение:
//     Соответствие - Ключ - исходная ссылка, значение - строка - описание, почему замена недопустима.
//                    Если все замены допустимы, то возвращается пустое соответствие;
//
Функция ВозможностьЗаменыЭлементов(Знач ПарыЗамен, Знач Параметры = Неопределено) Экспорт
	
	СпособУдаления = "";
	Если Параметры <> Неопределено Тогда
		Параметры.Свойство("СпособУдаления", СпособУдаления);
	КонецЕсли;
			
	Результат = Новый Соответствие;
	
	Для Каждого КлючЗначение Из ПарыЗамен Цикл
		ТекущаяСсылка = КлючЗначение.Ключ;
		ЦелеваяСсылка = КлючЗначение.Значение;
		
		Если ТекущаяСсылка = ЦелеваяСсылка Тогда
			Продолжить;
			
		Иначе	
			ТекущийЭлемент = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущаяСсылка, 
			"Организация, Контрагент, ВидДоговора, УчетПредметаДоговора, ЗаключаетсяПоРезультатамКонкурсныхПроцедур, ПризнакЗавершенияКонкурсныхПроцедур, РезультатЗавершенияКонкурсныхПроцедур, Долгосрочный, ПубличноеНормативноеОбязательство");
			ЦелевойЭлемент = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЦелеваяСсылка, 
			"Организация, Контрагент, ВидДоговора, УчетПредметаДоговора, ЗаключаетсяПоРезультатамКонкурсныхПроцедур, ПризнакЗавершенияКонкурсныхПроцедур, РезультатЗавершенияКонкурсныхПроцедур, Долгосрочный, ПубличноеНормативноеОбязательство");
			
			Если НЕ (ТекущийЭлемент.Организация = ЦелевойЭлемент.Организация) Тогда
				Ошибка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'замена возможна только для договоров одной организации.
				|У элементов ""%1"" и ""%2"" различаются организации ""%3"" ""%4"".'"),
				ТекущаяСсылка, ЦелеваяСсылка, ТекущийЭлемент.Организация, ЦелевойЭлемент.Организация);
				
				Результат.Вставить(ТекущаяСсылка, Ошибка);
				Продолжить;
			КонецЕсли;	

			Если НЕ (ТекущийЭлемент.Контрагент = ЦелевойЭлемент.Контрагент) Тогда
				Ошибка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'замена возможна только для договоров одного контрагента.
				|У элементов ""%1"" и ""%2"" различаются контрагенты ""%3"" ""%4"".'"),
				ТекущаяСсылка, ЦелеваяСсылка, ТекущийЭлемент.Контрагент, ЦелевойЭлемент.Контрагент);
				
				Результат.Вставить(ТекущаяСсылка, Ошибка);
				Продолжить;
			КонецЕсли;	

			Если НЕ (ТекущийЭлемент.ВидДоговора = ЦелевойЭлемент.ВидДоговора) Тогда
				Ошибка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'замена возможна только для договоров одного вида.
				|У элементов ""%1"" и ""%2"" различаются виды ""%3"" ""%4"".'"),
				ТекущаяСсылка, ЦелеваяСсылка, ТекущийЭлемент.ВидДоговора, ЦелевойЭлемент.ВидДоговора);
				
				Результат.Вставить(ТекущаяСсылка, Ошибка);
				Продолжить;
			КонецЕсли;	

			ДействующийДокументТекущий = РаботаСОбязательствами.ПолучитьПервичныйДействующийДокумент(ТекущаяСсылка).ДействующийДокумент;
			ДействующийДокументЦелевой = РаботаСОбязательствами.ПолучитьПервичныйДействующийДокумент(ЦелеваяСсылка).ДействующийДокумент;
			
			Если ЗначениеЗаполнено(ДействующийДокументТекущий) И ЗначениеЗаполнено(ДействующийДокументЦелевой) Тогда
				Ошибка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'для договоров с введенными планами финансирования замена невозможна. 
				|У элементов ""%1"" и ""%2"" существуют планы финансирования.'"),
				ТекущаяСсылка, ЦелеваяСсылка);
				
				Результат.Вставить(ТекущаяСсылка, Ошибка);
				Продолжить;
			КонецЕсли;
			
			Если (ЗначениеЗаполнено(ДействующийДокументТекущий) ИЛИ ЗначениеЗаполнено(ДействующийДокументЦелевой))
				И (НЕ ТекущийЭлемент.УчетПредметаДоговора = ЦелевойЭлемент.УчетПредметаДоговора 
				   ИЛИ НЕ ТекущийЭлемент.ЗаключаетсяПоРезультатамКонкурсныхПроцедур = ЦелевойЭлемент.ЗаключаетсяПоРезультатамКонкурсныхПроцедур 
				   ИЛИ НЕ ТекущийЭлемент.ПризнакЗавершенияКонкурсныхПроцедур = ЦелевойЭлемент.ПризнакЗавершенияКонкурсныхПроцедур 
				   ИЛИ НЕ ТекущийЭлемент.РезультатЗавершенияКонкурсныхПроцедур = ЦелевойЭлемент.РезультатЗавершенияКонкурсныхПроцедур 
				   ИЛИ НЕ ТекущийЭлемент.Долгосрочный = ЦелевойЭлемент.Долгосрочный
				   ИЛИ НЕ ТекущийЭлемент.ПубличноеНормативноеОбязательство = ЦелевойЭлемент.ПубличноеНормативноеОбязательство)
				Тогда
				
				Ошибка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'для договоров с введенным планом финансирования замена возможна 
				|только для элементов с совпадающими признаками учета.
				|У элементов ""%1"" и ""%2"" признаки учета не совпадают.'"),
				ТекущаяСсылка, ЦелеваяСсылка);
				
				Результат.Вставить(ТекущаяСсылка, Ошибка);
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейсПодготовкиДанныхЭДО

Функция ПолучитьДанныеДляЭД(СсылкаНаОбъект) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Договоры.Ссылка КАК Ссылка,
	               |	Договоры.ВидДоговора КАК ВидДоговора,
	               |	Договоры.ДатаДоговора КАК ДатаДоговора,
	               |	Договоры.НомерДоговора КАК НомерДоговора,
	               |	Договоры.Контрагент КАК Контрагент,
	               |	ВЫРАЗИТЬ(Договоры.Контрагент КАК Справочник.Контрагенты).ВидКонтрагента КАК Контрагент_ВидКонтрагента,
	               |	Договоры.Организация КАК Организация,
	               |	ПараметрыДоговораДляЭДО.ДатаНачалаДействия КАК ДатаНачалаДействия,
	               |	ПараметрыДоговораДляЭДО.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	               |	ПараметрыДоговораДляЭДО.Сумма КАК Сумма,
	               |	ПараметрыДоговораДляЭДО.СуммаНДС КАК СуммаНДС,
	               |	ПараметрыДоговораДляЭДО.НаличиеПролонгации КАК НаличиеПролонгации,
	               |	ПараметрыДоговораДляЭДО.РеквизитыЛицевогоСчета КАК РеквизитыЛицевогоСчета,
	               |	ПараметрыДоговораДляЭДО.РасчетныйСчетКонтрагента КАК РасчетныйСчетКонтрагента,
	               |	ПараметрыДоговораДляЭДО.ВалютаДоговора КАК ВалютаДоговора,
	               |	ПараметрыДоговораДляЭДО.ВалютаРасчетов КАК ВалютаРасчетов,
	               |	ПараметрыДоговораДляЭДО.Ссылка КАК ПараметрыДоговораДляЭДО,
	               |	ПараметрыДоговораДляЭДО.МестоЗаключенияДоговора КАК МестоЗаключенияДоговора,
	               |	ПараметрыДоговораДляЭДО.ФункцияЭД КАК ФункцияЭД,
	               |	ПараметрыДоговораДляЭДО.МестоПереходаПраваСобственности КАК МестоПереходаПраваСобственности,
	               |	ПараметрыДоговораДляЭДО.Инкотермс КАК Инкотермс,
	               |	ПараметрыДоговораДляЭДО.ИныеСведенияОбУсловияхПоставки КАК ИныеСведенияОбУсловияхПоставки,
	               |	ПараметрыДоговораДляЭДО.ВидПлатежа КАК ВидПлатежа,
	               |	ПараметрыДоговораДляЭДО.КоличествоПлатежей КАК КоличествоПлатежей,
	               |	ПараметрыДоговораДляЭДО.ПроцентРасчета КАК ПроцентРасчета,
	               |	ПараметрыДоговораДляЭДО.СрокПоставки КАК СрокПоставки,
	               |	ПараметрыДоговораДляЭДО.РазмерПени КАК РазмерПени,
	               |	ПараметрыДоговораДляЭДО.СрокОплаты КАК СрокОплаты,
	               |	ПараметрыДоговораДляЭДО.СобытиеНачалаОтсчетаСрокаОплаты КАК СобытиеНачалаОтсчетаСрокаОплаты,
	               |	Договоры.ЭтоЭлектронныйДокумент КАК ЭтоЭлектронныйДокумент
	               |ИЗ
	               |	Справочник.Договоры КАК Договоры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПараметрыДоговораДляЭДО КАК ПараметрыДоговораДляЭДО
	               |		ПО (ПараметрыДоговораДляЭДО.Договор = Договоры.Ссылка)
	               |ГДЕ
	               |	Договоры.Ссылка = &Ссылка
	               |	И ПараметрыДоговораДляЭДО.Договор = &Ссылка
	               |	И ПараметрыДоговораДляЭДО.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ПредварительныйКонтрольДанныхДляЭД(СсылкаНаОбъект) Экспорт
	Результат = Истина;

	Реквизиты = "ЭтоЭлектронныйДокумент";
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, Реквизиты);
	
	Если НЕ ЗначенияРеквизитов.ЭтоЭлектронныйДокумент Тогда
		ОписаниеОшибки = НСтр("ru='Не включена отметка ""Договор в электронном виде"" на закладке ""Расчеты"".'");
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
		
		Возврат Ложь;
	КонецЕсли;	
	
	ДанныеЭД = ПолучитьДанныеДляЭД(СсылкаНаОбъект);
	Если ДанныеЭД.Количество() = 0 Тогда
		ОписаниеОшибки = НСтр("ru='Не заполнены параметры электронного договора.'");
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
		
		Возврат Ложь;
	КонецЕсли;
	Данные = ДанныеЭД[0];
	
	Если НЕ ЗначениеЗаполнено(Данные.Организация) Тогда
		ОписаниеОшибки = НСтр("ru='Не заполнена организация.'");
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
		Результат = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Данные.Контрагент) Тогда
		ОписаниеОшибки = НСтр("ru='Не заполнен контрагент.'");
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
		Результат = Ложь;
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции	

#КонецОбласти

Функция ОпределитьДоговор(Организация, Контрагент, НомерБО, ИГК, НомерРеестровойЗаписи, ДополнительныеПараметры, Создавать = Ложь) Экспорт  
	
	НайденныйДоговор = Справочники.Договоры.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(НомерБО) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УчетныеНомераОбязательств.Обязательство КАК Обязательство
		|ИЗ
		|	РегистрСведений.УчетныеНомераОбязательств КАК УчетныеНомераОбязательств
		|ГДЕ
		|	УчетныеНомераОбязательств.УчетныйНомерОбязательства = &УчетныйНомерОбязательства");
		Запрос.УстановитьПараметр("УчетныйНомерОбязательства", НомерБО);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			НайденныйДоговор = Выборка.Обязательство;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(ИГК) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ГосударственныеКонтрактыЕИС.ВладелецКонтракта КАК ВладелецКонтракта
		|ИЗ
		|	Справочник.ГосударственныеКонтрактыЕИС КАК ГосударственныеКонтрактыЕИС
		|ГДЕ
		|	ГосударственныеКонтрактыЕИС.НомерИГК = &НомерИГК");
		Запрос.УстановитьПараметр("НомерИГК", ИГК);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			НайденныйДоговор = Выборка.ВладелецКонтракта;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(НомерРеестровойЗаписи) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ГосударственныеКонтрактыЕИС.ВладелецКонтракта КАК ВладелецКонтракта
		|ИЗ
		|	Справочник.ГосударственныеКонтрактыЕИС КАК ГосударственныеКонтрактыЕИС
		|ГДЕ
		|	ГосударственныеКонтрактыЕИС.Код = &Код
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ХарактеристикиОбязательствСрезПоследних.Договор
		|ИЗ
		|	РегистрСведений.ХарактеристикиОбязательств.СрезПоследних КАК ХарактеристикиОбязательствСрезПоследних
		|ГДЕ
		|	ХарактеристикиОбязательствСрезПоследних.ВидХарактеристики = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыХарактеристикОбязательства.НомерРеестровойЗаписи)
		|	И ХарактеристикиОбязательствСрезПоследних.ЗначениеХарактеристики = &Код
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ХарактеристикиОбязательствСрезПоследних.Договор
		|ИЗ
		|	РегистрСведений.ХарактеристикиОбязательств.СрезПоследних КАК ХарактеристикиОбязательствСрезПоследних
		|ГДЕ
		|	ХарактеристикиОбязательствСрезПоследних.ВидХарактеристики = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыХарактеристикОбязательства.НомерРеестровойЗаписиВРеестреКонтрактов)
		|	И ХарактеристикиОбязательствСрезПоследних.ЗначениеХарактеристики = &Код");
		Запрос.УстановитьПараметр("Код", СтроковыеФункцииКлиентСервер.ДополнитьСтроку(НомерРеестровойЗаписи, 19, " ", "Справа"));
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			НайденныйДоговор = Выборка.ВладелецКонтракта;
		КонецЕсли;	
	ИначеЕсли ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Договоры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Договоры КАК Договоры
		|ГДЕ
		|	НЕ Договоры.ПометкаУдаления
		|	И НЕ Договоры.ВАрхиве
		|	И Договоры.Контрагент = &Контрагент
		|	И Договоры.Организация = &Организация
		|	И Договоры.НомерДоговора = &НомерДоговора
		|	И Договоры.ДатаДоговора = &ДатаДоговора");  
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("НомерДоговора", ДополнительныеПараметры.ДокументОснованиеНомер);
		Запрос.УстановитьПараметр("ДатаДоговора", ДополнительныеПараметры.ДокументОснованиеДата);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			НайденныйДоговор = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;	
		
    Возврат НайденныйДоговор;
	
КонецФункции

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если Данные.ВАрхиве Тогда
		Представление = "(ЗАКРЫТ " + Формат(Данные.ДатаПомещенияВАрхив, "ДФ=dd.MM.yy") + ") " + Данные.Наименование;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;	
		
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Добавить("Наименование");
	Поля.Добавить("ВАрхиве");
	Поля.Добавить("ДатаПомещенияВАрхив");
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Организация");
	Результат.Добавить("Контрагент");
	Результат.Добавить("ВидДоговора");
	Результат.Добавить("Долгосрочный");
	Результат.Добавить("УчетПредметаДоговора");
	Результат.Добавить("ЗаключаетсяПоРезультатамКонкурсныхПроцедур");
	
	Результат.Добавить("Контрагенты");
	
	Результат.Добавить("ВестиГрафикПлатежей");
	Результат.Добавить("ВестиПланГрафикИсполнения");
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает таблицу реквизитов, зависимых от вида договора и организации
//
Функция ПолучитьМассивыРеквизитов(Объект, МассивВсехРеквизитов, МассивРеквизитовОперации) Экспорт
	
	МассивВсехРеквизитов = Новый Массив;
	МассивВсехРеквизитов.Добавить("Контрагент");
	МассивВсехРеквизитов.Добавить("ПорядокРегистрацииСчетаФактурыНаАванс");
	МассивВсехРеквизитов.Добавить("Долгосрочный");
	МассивВсехРеквизитов.Добавить("УчетПредметаДоговора");
	
	МассивРеквизитовОперации = Новый Массив;
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
		
		МассивРеквизитовОперации.Добавить("ТипДоговораНДС");
		МассивРеквизитовОперации.Добавить("Долгосрочный");
		МассивРеквизитовОперации.Добавить("УчетПредметаДоговора");
		МассивРеквизитовОперации.Добавить("ЗаключаетсяПоРезультатамКонкурсныхПроцедур");
		
		Если Объект.ЗаключаетсяПоРезультатамКонкурсныхПроцедур = ?(Объект.РезультатЗавершенияКонкурсныхПроцедур = 1, Истина, Ложь) Тогда
			МассивРеквизитовОперации.Добавить("Контрагент");
		КонецЕсли;
		
	ИначеЕсли Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
		
		МассивРеквизитовОперации.Добавить("Контрагент");
		МассивРеквизитовОперации.Добавить("ПорядокРегистрацииСчетаФактурыНаАванс");
		МассивРеквизитовОперации.Добавить("УчетПредметаДоговора");
		
	ИначеЕсли Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СоглашениеОСубсидии
		ИЛИ Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СОтправителемТрансферта
		ИЛИ Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ПредоставленныйКредит
		ИЛИ Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ПолученныйКредит
		ИЛИ Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ПредоставленнаяГарантия
		ИЛИ Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВыпускЦенныхБумаг Тогда
		
		МассивРеквизитовОперации.Добавить("Контрагент");
		МассивРеквизитовОперации.Добавить("Долгосрочный");
		
	ИначеЕсли Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ИноеОбязательство 
		ИЛИ Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом
		ИЛИ Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером
		ИЛИ Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку
		ИЛИ Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку Тогда
		
		МассивРеквизитовОперации.Добавить("Контрагент");
		
	КонецЕсли;
	
КонецФункции

Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("ЭлементГруппа");
	Возврат МассивРеквизитов;
КонецФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	Если ПравоДоступа("Просмотр", Метаданные.Справочники.Договоры) Тогда	
		
		// Сведения о принятом бюджетном обязательстве (ф. 0506101)
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати 		= "Обработка.ПечатьСведенийПоДоговорамИОбязательствам";
		КомандаПечати.Идентификатор 		= "СведенияБО";
		КомандаПечати.Представление 		= НСтр("ru = 'Сведения о бюджетном обязательстве (письмо от 12.01.2021 N 09-01-09/563))'");
		КомандаПечати.Порядок				= 1;
		КомандаПечати.Обработчик 			= "РаботаСОбязательствамиКлиент.ОбработкаКомандыПечатиСведенияБОДоговор";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ДоговораПечатьФорма0506101", Истина, ВидСравнения.Равно);
		
		// Сведения о контракте   
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати 		= "Обработка.ПечатьСведенийПоДоговорамИОбязательствам";
		КомандаПечати.Идентификатор 		= "СведенияГК_17н2026";
		КомандаПечати.Представление 		= НСтр("ru = 'Сведения о контракте (с 01.03.2026)'");
		КомандаПечати.Порядок				= 2;
		КомандаПечати.Обработчик 			= "РаботаСОбязательствамиКлиент.ОбработкаКомандыПечатиСведенийОГКДоговор";              
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ДоговораПечатьСведенийГК", Истина, ВидСравнения.Равно); 
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати 		= "Обработка.ПечатьСведенийПоДоговорамИОбязательствам";
		КомандаПечати.Идентификатор 		= "СведенияГК_17н2025";
		КомандаПечати.Представление 		= НСтр("ru = 'Сведения о контракте (с 01.01.2025)'");
		КомандаПечати.Порядок				= 3;
		КомандаПечати.Обработчик 			= "РаботаСОбязательствамиКлиент.ОбработкаКомандыПечатиСведенийОГКДоговор";              
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ДоговораПечатьСведенийГК", Истина, ВидСравнения.Равно); 
						
		// Сведения об исполнении (о расторжении) контракта
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати 		= "Обработка.ПечатьСведенийПоДоговорамИОбязательствам";
		КомандаПечати.Идентификатор 		= "СведенияОПрекращении17н2026";
		КомандаПечати.Представление 		= НСтр("ru = 'Сведения об исполнении (о расторжении) контракта (с 01.03.2026)'");
		КомандаПечати.Порядок				= 4;
		КомандаПечати.Обработчик 			= "РаботаСОбязательствамиКлиент.ОбработкаКомандыПечатиСведенийОПрекращенииДоговор";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ДоговораПечатьСведенийГК", Истина, ВидСравнения.Равно); 
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати 		= "Обработка.ПечатьСведенийПоДоговорамИОбязательствам";
		КомандаПечати.Идентификатор 		= "СведенияОПрекращении17н2025";
		КомандаПечати.Представление 		= НСтр("ru = 'Сведения об исполнении (о расторжении) контракта (с 01.01.2025)'");
		КомандаПечати.Порядок				= 5;
		КомандаПечати.Обработчик 			= "РаботаСОбязательствамиКлиент.ОбработкаКомандыПечатиСведенийОПрекращенииДоговор";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ДоговораПечатьСведенийГК", Истина, ВидСравнения.Равно); 

		// Сведения о контракте
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати 		= "Обработка.ПечатьСведенийПоДоговорамИОбязательствам";
		КомандаПечати.Идентификатор 		= "СведенияГК_17н";
		КомандаПечати.Представление 		= НСтр("ru = '(уст.)Сведения о контракте (17н)'");
		КомандаПечати.Порядок				= 100;
		КомандаПечати.Обработчик 			= "РаботаСОбязательствамиКлиент.ОбработкаКомандыПечатиСведенийОГКДоговор";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ДоговораПечатьСведенийГК", Истина, ВидСравнения.Равно);

		// Сведения об исполнении (о расторжении) контракта
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати 		= "Обработка.ПечатьСведенийПоДоговорамИОбязательствам";
		КомандаПечати.Идентификатор 		= "СведенияОПрекращении17н";
		КомандаПечати.Представление 		= НСтр("ru = '(уст.) Сведения об исполнении (о расторжении) контракта (17н)'");
		КомандаПечати.Порядок				= 100;
		КомандаПечати.Обработчик 			= "РаботаСОбязательствамиКлиент.ОбработкаКомандыПечатиСведенийОПрекращенииДоговор";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ДоговораПечатьСведенийГК", Истина, ВидСравнения.Равно);
		
		// Сведения о контракте
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати 		= "Обработка.ПечатьСведенийПоДоговорамИОбязательствам";
		КомандаПечати.Идентификатор 		= "СведенияГК_31н";
		КомандаПечати.Представление 		= НСтр("ru = '(уст.) Сведения о контракте (31н)'");
		КомандаПечати.Порядок				= 100;
		КомандаПечати.Обработчик 			= "РаботаСОбязательствамиКлиент.ОбработкаКомандыПечатиСведенийОГКДоговор";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ДоговораПечатьСведенийГК", Истина, ВидСравнения.Равно);
		
		// Сведения об исполнении (о расторжении) контракта
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати 		= "Обработка.ПечатьСведенийПоДоговорамИОбязательствам";
		КомандаПечати.Идентификатор 		= "СведенияОПрекращении31н";
		КомандаПечати.Представление 		= НСтр("ru = '(уст.) Сведения об исполнении (о расторжении) контракта (31н)'");
		КомандаПечати.Порядок				= 100;
		КомандаПечати.Обработчик 			= "РаботаСОбязательствамиКлиент.ОбработкаКомандыПечатиСведенийОПрекращенииДоговор";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ДоговораПечатьСведенийГК", Истина, ВидСравнения.Равно);

		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати 		= "Обработка.ПечатьСведенийПоДоговорамИОбязательствам";
		КомандаПечати.Идентификатор 		= "Форма0506101";
		КомандаПечати.Представление 		= НСтр("ru = '(уст.) Сведения о бюджетном обязательстве (ф. 0506101)'");
		КомандаПечати.Порядок				= 100;
		КомандаПечати.Обработчик 			= "РаботаСОбязательствамиКлиент.ОбработкаКомандыПечатиФ0506101Договор";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ДоговораПечатьФорма0506101", Истина, ВидСравнения.Равно);

		
		// Сведения о контракте
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати 		= "Обработка.ПечатьСведенийПоДоговорамИОбязательствам";
		КомандаПечати.Идентификатор 		= "СведенияГК_18н";
		КомандаПечати.Представление 		= НСтр("ru = '(уст.) Сведения о контракте (18н)'");
		КомандаПечати.Порядок				= 100;
		КомандаПечати.Обработчик 			= "РаботаСОбязательствамиКлиент.ОбработкаКомандыПечатиСведенийОГКДоговор";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ДоговораПечатьСведенийГК", Истина, ВидСравнения.Равно);
		
		// Сведения об исполнении (о расторжении) контракта
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати 		= "Обработка.ПечатьСведенийПоДоговорамИОбязательствам";
		КомандаПечати.Идентификатор 		= "СведенияОПрекращении18н";
		КомандаПечати.Представление 		= НСтр("ru = '(уст.) Сведения об исполнении (о расторжении) контракта (18н)'");
		КомандаПечати.Порядок				= 100;
		КомандаПечати.Обработчик 			= "РаботаСОбязательствамиКлиент.ОбработкаКомандыПечатиСведенийОПрекращенииДоговор";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ДоговораПечатьСведенийГК", Истина, ВидСравнения.Равно);


		// Сведения о принятом бюджетном обязательстве (ф. 0531702), в ред. приказа 140н
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати 		= "Обработка.ПечатьСведенийПоДоговорамИОбязательствам";
		КомандаПечати.Идентификатор 		= "Форма0531702_140н";
		КомандаПечати.Представление 		= НСтр("ru = '(уст.) Сведения о принятом бюджетном обязательстве (ф. 0531702) в ред. 140н'");
		КомандаПечати.Порядок				= 100;
		КомандаПечати.Обработчик 			= "РаботаСОбязательствамиКлиент.ОбработкаКомандыПечатиФ0531702Договор";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ДоговораПечатьФорма0531702", Истина, ВидСравнения.Равно);
		
		// Заявка на внесение изменений в принятое бюджетное обязательство (ф. 0531705), в ред. приказа 140н
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати 		= "Обработка.ПечатьСведенийПоДоговорамИОбязательствам";
		КомандаПечати.Идентификатор 		= "Форма0531705_140н";
		КомандаПечати.Представление 		= НСтр("ru = '(уст.) Заявка на внесение изменений в принятое бюджетное обязательство (ф. 0531705) в ред. 140н'");
		КомандаПечати.Порядок				= 100;
		КомандаПечати.Обработчик 			= "РаботаСОбязательствамиКлиент.ОбработкаКомандыПечатиФ0531705Договор";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ДоговораПечатьФорма0531705", Истина, ВидСравнения.Равно);

		// Заявка на перерегистрацию бюджетного обязательства (ф. 0531706), в ред. приказа 140н
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати 		= "Обработка.ПечатьСведенийПоДоговорамИОбязательствам";
		КомандаПечати.Идентификатор 		= "Форма0531706_140н";
		КомандаПечати.Представление 		= НСтр("ru = '(уст.) Заявка на перерегистрацию бюджетного обязательства (ф. 0531706) в ред. 140н'");
        КомандаПечати.Порядок				= 100;
		КомандаПечати.Обработчик 			= "РаботаСОбязательствамиКлиент.бработкаКомандыПечатиФ0531706Договор";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ДоговораПечатьФорма0531706", Истина, ВидСравнения.Равно);
		
		// Сведения о принятом бюджетном обязательстве (ф. 0531702), в ред. приказа 151н
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати 		= "Обработка.ПечатьСведенийПоДоговорамИОбязательствам";
		КомандаПечати.Идентификатор 		= "Форма0531702_151н";
		КомандаПечати.Представление 		= НСтр("ru = '(уст.) Сведения о принятом бюджетном обязательстве (ф. 0531702) в ред. 151н'");
		КомандаПечати.Порядок				= 100;
		КомандаПечати.Обработчик 			= "РаботаСОбязательствамиКлиент.ОбработкаКомандыПечатиФ0531702Договор";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ДоговораПечатьФорма0531702", Истина, ВидСравнения.Равно);

		// Сведения о принятом бюджетном обязательстве (ф. 0531702)
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати 		= "Обработка.ПечатьСведенийПоДоговорамИОбязательствам";
		КомандаПечати.Идентификатор 		= "Форма0531702";
		КомандаПечати.Представление 		= НСтр("ru = '(уст.) Сведения о принятом бюджетном обязательстве (ф. 0531702) в ред. 98н'");
		КомандаПечати.Порядок				= 100;
		КомандаПечати.Обработчик 			= "РаботаСОбязательствамиКлиент.ОбработкаКомандыПечатиФ0531702Договор";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ДоговораПечатьФорма0531702", Истина, ВидСравнения.Равно);
		
		// Заявка на внесение изменений в принятое бюджетное обязательство (ф. 0531705), в ред. приказа 151н
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати 		= "Обработка.ПечатьСведенийПоДоговорамИОбязательствам";
		КомандаПечати.Идентификатор 		= "Форма0531705_151н";
		КомандаПечати.Представление 		= НСтр("ru = '(уст.) Заявка на внесение изменений в принятое бюджетное обязательство (ф. 0531705) в ред. 151н'");
		КомандаПечати.Порядок				= 100;
		КомандаПечати.Обработчик 			= "РаботаСОбязательствамиКлиент.ОбработкаКомандыПечатиФ0531705Договор";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ДоговораПечатьФорма0531705", Истина, ВидСравнения.Равно);

		// Заявка на внесение изменений в принятое бюджетное обязательство (ф. 0531705)
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати 		= "Обработка.ПечатьСведенийПоДоговорамИОбязательствам";
		КомандаПечати.Идентификатор 		= "Форма0531705";
		КомандаПечати.Представление 		= НСтр("ru = '(уст.) Заявка на внесение изменений в принятое бюджетное обязательство (ф. 0531705) в ред. 98н'");
		КомандаПечати.Порядок				= 100;
		КомандаПечати.Обработчик 			= "РаботаСОбязательствамиКлиент.ОбработкаКомандыПечатиФ0531705Договор";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ДоговораПечатьФорма0531705", Истина, ВидСравнения.Равно);
		
		// Заявка на перерегистрацию бюджетного обязательства (ф. 0531706), в ред. приказа 151н
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати 		= "Обработка.ПечатьСведенийПоДоговорамИОбязательствам";
		КомандаПечати.Идентификатор 		= "Форма0531706_151н";
		КомандаПечати.Представление 		= НСтр("ru = '(уст.) Заявка на перерегистрацию бюджетного обязательства (ф. 0531706) в ред. 151н'");
        КомандаПечати.Порядок				= 100;
		КомандаПечати.Обработчик 			= "РаботаСОбязательствамиКлиент.бработкаКомандыПечатиФ0531706Договор";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ДоговораПечатьФорма0531706", Истина, ВидСравнения.Равно);
		 
		// Заявка на перерегистрацию бюджетного обязательства (ф. 0531706)
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати 		= "Обработка.ПечатьСведенийПоДоговорамИОбязательствам";
		КомандаПечати.Идентификатор 		= "Форма0531706";
		КомандаПечати.Представление 		= НСтр("ru = '(уст.) Заявка на перерегистрацию бюджетного обязательства (ф. 0531706) в ред. 98н'");
		КомандаПечати.Порядок				= 100;
		КомандаПечати.Обработчик 			= "РаботаСОбязательствамиКлиент.бработкаКомандыПечатиФ0531706Договор";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ДоговораПечатьФорма0531706", Истина, ВидСравнения.Равно);
		
		// Информация о контракте
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати 		= "Обработка.ПечатьСведенийПоДоговорамИОбязательствам";
		КомандаПечати.Идентификатор 		= "ИнформацияГК";
		КомандаПечати.Представление 		= НСтр("ru = '(уст.) Информация о контракте (142н)'");
		КомандаПечати.Порядок				= 100;
		КомандаПечати.Обработчик 			= "РаботаСОбязательствамиКлиент.ОбработкаКомандыПечатиСведенийОГКДоговор";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ДоговораПечатьСведенийГК", Истина, ВидСравнения.Равно);

		// Сведения о контракте
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати 		= "Обработка.ПечатьСведенийПоДоговорамИОбязательствам";
		КомандаПечати.Идентификатор 		= "СведенияГК";
		КомандаПечати.Представление 		= НСтр("ru = '(уст.) Сведения о контракте'");
		КомандаПечати.Порядок				= 100;
		КомандаПечати.Обработчик 			= "РаботаСОбязательствамиКлиент.ОбработкаКомандыПечатиСведенийОГКДоговор";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ДоговораПечатьСведенийГК", Истина, ВидСравнения.Равно);
		
		// Информация об исполнении (о расторжении) контракта
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати 		= "Обработка.ПечатьСведенийПоДоговорамИОбязательствам";
		КомандаПечати.Идентификатор 		= "ИнформацияОбИсполнении";
		КомандаПечати.Представление 		= НСтр("ru = '(уст.) Информация об исполнении (о расторжении) контракта (142н)'");
		КомандаПечати.Порядок				= 100;
		КомандаПечати.Обработчик 			= "РаботаСОбязательствамиКлиент.ОбработкаКомандыПечатиСведенийОПрекращенииДоговор";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ДоговораПечатьСведенийГК", Истина, ВидСравнения.Равно);

         
		// Сведения об исполнении (о расторжении) контракта
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати 		= "Обработка.ПечатьСведенийПоДоговорамИОбязательствам";
		КомандаПечати.Идентификатор 		= "СведенияОПрекращении";
		КомандаПечати.Представление 		= НСтр("ru = '(уст.) Сведения об исполнении (о расторжении) контракта'");
		КомандаПечати.Порядок				= 100;
		КомандаПечати.Обработчик 			= "РаботаСОбязательствамиКлиент.ОбработкаКомандыПечатиСведенийОПрекращенииДоговор";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ДоговораПечатьСведенийГК", Истина, ВидСравнения.Равно);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДоговорПоГОЗ(Организация, Контрагент, ЛицевойСчет, ВидДоговора) Экспорт
	
	ДоговорПоУмолчанию = Справочники.Договоры.ПустаяСсылка();
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	Договоры.Ссылка
	                      |ИЗ
	                      |	Справочник.Договоры КАК Договоры
	                      |ГДЕ
	                      |	Договоры.Организация = &Организация
	                      |	И Договоры.Контрагент = &Контрагент
	                      |	И Договоры.КонтрактСУчастникомГОЗ
	                      |	И Договоры.ОтдельныйСчетДляРасчетовПоГОЗ = &ЛицевойСчет
	                      |	И Договоры.ВидДоговора = &ВидДоговора");
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Возврат ДоговорПоУмолчанию;
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		
		Выборка.Следующий();
		
		Возврат Выборка.Ссылка;
	
	КонецЕсли;
	
	Возврат ДоговорПоУмолчанию;
	
КонецФункции

#КонецОбласти 

#КонецЕсли
